[
  {
    "title": "Round 1 of Playoffs in the Books - Final Four Teams Set in MLP",
    "headline": "Round 1 of Playoffs in the Books - Final Four Teams Set in MLP",
    "content": "This weekend, the first round of the Major League Pickleball (MLP) playoffs took place in San Diego, California, at the Barnes Tennis Center.\n\nThe Premier Level saw all 10 playoff contenders converge to fight it out for one of the four spots in the semifinals in MLP New York next weekend.\n\nIn Challenger, all six teams played, with only two earning the right to play in the finals in New York.\n\nLet’s get into the action.\n\nIn what was a perplexing move, the Dallas Flash, the #2 overall seed, chose to play the Columbus Sliders in the quarterfinals. The Flash had the choice of playing the Texas Ranchers, Columbus Sliders, or the LA Mad Drops.\n\nMany pundits mentioned this as a strategic error, including Zane Navratil:\n\nDallas Flash versus Columbus Sliders was the best MLP series of all time, but the fact that they even played was the worst strategic blunder of all time.\n\nWhile at the event, I was able to personally talk to Mark Molthan, the owner of the Dallas Flash. He confirmed the rumors that the players decided they wanted to play the Sliders. Many people thought they should have chosen to play the Texas Ranchers.\n\nHowever, once they finished their first match, I thought it may have been a good decision, and here is why:\n\nThe Sliders were never going to beat the Flash in regulation, so the best they could hope for was a Dreambreaker win. In the first match they played on Friday night, the Dallas Flash didn’t play their best in doubles, but still won the DreamBreaker. Tyra and Jorja went 12-5 against Parris and Lea in the DreamBreaker to seal the deal, winning 21-18. I thought to myself, “If Dallas didn’t play great, but still found a way to win, their next one should be much easier.”\n\nA post shared by Dallas Flash Pickleball (@dallasflashpb)\n\nI was wrong. Columbus came out on Saturday night and once again beat JW Johnson in both of his doubles games. Through two matches, JW Johnson was 0-4 in his doubles games. This time, though, the tables turned for Columbus in the DreamBreaker. Lea Jansen carried the team, going 8-0 in her DreamBreaker points against Tyra, leading Columbus to a 21-14 Dreambreaker win.\n\nAll the marbles were on the line in the third and final match on Sunday - win or go home. The Sliders got off to a HOT start, winning both gender doubles games, 11-4. It looked somewhat over for the Dallas Flash, because Columbus had grabbed all the momentum. Instead, Dallas fought back in both mixed games, winning 11-3, and 11-8. JW Johnson earned his first doubles victory of the weekend in the last mixed game against Andrei and Parris. And it seemed as though the momentum had shifted back to Dallas.\n\nA post shared by Major League Pickleball (@majorleaguepb)\n\nIn the third and deciding DreamBreaker, Andrei Daescu went 8-4 against JW Johnson, including a 4-0 of him in the second round. Having lost to Augie 1-3, 1-3 in his first two rounds, CJ Klinger stepped up to the plate at 18-18, and rattled off three points in a row, to clinch the match and series win.\n\nThis was a huge win for the Columbus Sliders, and threw a huge wrench in the playoff picture, as the Flash were heavy favorites in this one.\n\nOn the other hand, The LA Mad Drops handled the Brooklyn Pickleball Team with ease, in their quarterfinal matchup.\n\nBrooklyn was very unlucky throughout the regular season, in terms of health. Specifically, at one point all three of their men (Riley Newman, Dekel Bar, and Pat Smith) were all out with illness and/or injury.\n\nThis bad luck carried over to the playoffs, where despite earning the four seed, they were forced to play the newly rejuvenated LA Mad Drops in the quarterfinals of the playoffs, against Ben Johns.\n\nThe first match was all LA - in fact, it was so lopsided, that LA won 3-0, by a combined score of 33-10 on Saturday.\n\nSunday was much more competitive, with Rachel and Jackie taking out Catherine and Jade, 11-8 in women’s. LA went on to win the next three games, 11-4, 11-5, 11-7, securing their spot in the semis.\n\nIf your company is interested in reaching an audience of active pickleballers, you may want to give us a shout.\n\nIn what came as a surprise to the 5s, they played the Texas Ranchers in the quarterfinals. I think the majority of people thought the Flash were going to pick the Ranchers, and then the 5s were going to play the Sliders.\n\nInstead, the 5s beat the Ranchers 3-0 on Saturday, and followed that up with a DreamBreaker win on Sunday, 21-13.\n\nA post shared by Texas Ranchers (@rancherspickleball)\n\nThere were two noteworthy storylines outside the match scores in this matchup.\n\nFirst, the GM of the Texas Ranchers, Ryan Dawidjan, was not seen with the team during matches. He was sitting behind the team and didn't seem involved in the coaching and/or strategy of the team. I am unsure exactly what happened here, but I will continue to monitor the situation for any storylines.\n\nThe second thing that happened, was Christian Alshon losing his mind in the second match against the 5s. Leigh Waters is the coach of the 5s, and also coaches Alshon on the PPA Tour, when he is not playing against Anna Leigh Waters.\n\nAlshon just sent the double bird towards the 5s bench and continued arguing with Leigh Waters after the mens game and before his mixed game.\n\nI was watching live from approximately 20 feet away, and I have no idea what Leigh Waters did to rile Alshon up, but he became unhinged in the men's doubles game of the second match on Sunday. At 7-6, they lost the point, and Oncins quickly called a timeout and as he was walking to the bench, Alshon flipped off the entire 5s bench with both middle fingers, while walking to his towel.\n\nA post shared by The NJ 5s | Major League Pickleball (@the5spickleball)\n\nHe was immediately given a blue card, which is like a technical warning on the PPA Tour. Credit to Alshon though, because he regrouped himself after the men's doubles loss, and beat Anna Leigh and Howells, 11-6, alongside Kaitlyn Christian.\n\nThe Ranchers forced the DreamBreaker, but couldn't find an answer for Anna Leigh Waters. She carried the 5s in the DreamBreaker, beating Kaitlyn Christian 7-1, on their way to the 21-13 win.\n\nThe 5s are going to into the semifinals as the second-best seed from the regular season still alive.\n\nSpeaking of the best teams from the regular season, the St. Louis Shock beat the Orlando Squeeze to punch their ticket to the semifinals in NYC in two matches.\n\nThey beat the Squeeze 3-0 on Friday, and 3-1 on Saturday. The Squeeze were without Dylan Frazier, who injured his right leg in the PPA Bristol Open last weekend. He was on-site cheering on his team and helping them get ready, but definitely wasn’t moving like his normal self.\n\nA post shared by Major League Pickleball (@majorleaguepb)\n\nThe Shock looked precise with their execution, going 7-1 in games. The only loss came on Saturday, when Anna Bright and Kate Fahey lost 8-11 to Lacy Schneemann and Milly Rane. Watching that game live, I thought that was the best both Schneemann and Rane have played together and overall in the last six months or so.\n\nThe Shock didn’t panic, and just battled back, winning men’s 11-8, and then mixed, 11-9, 11-4.\n\nI had the Shock as the favorites to win the whole thing heading into the playoffs, and nothing from San Diego has changed my mind.\n\nThe Las Vegas Night Owls and the Nashville Chefs were the best and second-best team in Challenger from wire to wire this year, respectively.\n\nLas Vegas was able to knock out the Bay Area Breakers 3-1, 3-0 on Saturday. The Chefs knocked out the California Black Bears 3-0, 3-1 on Saturday as well.\n\nThe most surprising thing from Challenger Level was the fact that the Chefs won 3-0 and 3-1 over California. Just a couple of weeks ago, California went 5-0 in MLP Salt Lake City, and beat the Chefs 4-0. The Chefs definitely changed some strategies and stuck with the game plan, and put on a show to earn a spot in the Challenger finals this weekend.\n\nA post shared by Las Vegas Night Owls (@lv.nightowls)\n\nIn talking to some of the Las Vegas players - they really want the win. They feel they are the best team in Challenger and since there is only one team moving up to Premier Level for next year, they want it to be them. Although Challenger Level doesn’t get a ton of attention, this finals matchup should be a highly entertaining affair.\n\nThe St. Louis Shock are required to tell the league which team (of the LA Mad Drops and the Columbus Sliders) they are choosing to play in the semis, by noon ET Monday. The 5s will play whoever the Shock does not pick.\n\nStay tuned for a full semifinal and final preview on Wednesday, and as always, subscribe to The Dink newsletter for all the breaking news in pickleball.",
    "published_at": "2025-08-18T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/08/Andrei-CJ-1.jpg"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Jaume Martinez Vich Joins adidas: 'Adding Power Opens Up New Weapons for Me'",
    "headline": "Jaume Martinez Vich Joins adidas: 'Adding Power Opens Up New Weapons for Me'",
    "content": "\n\nAfter Jaume Martinez Vich made a men's doubles finals run at PPA Bristol holding a new paddle emblazoned with the familiar three stripes, the whispers started circulating. Could it be true?\n\nNow we know for sure.\n\nYesterday, the news hit social media, as Jaume and adidas Pickleball made their new partnership Instagram official. The caption gave us a taste:\n\nBut we caught up with adidas to learn a little more. They can't disclose full details just yet, but their global vision and reach was a draw for Jaume as soon as he heard they were entering the pickleball space.\n\n\"I wanted to partner with a company that not only equips me with the best possible gear, but also shares my vision for growing pickleball globally,\" Jaume told The Dink. \"Joining the adidas Pickleball family felt like aligning with a team that’s as committed to elevating the sport as I am.\"\n\nAnd speaking of that gear, there's considerable hype building around what paddles adidas will be bringing to market next.\n\nThe Metalbone line was innovative to be sure, but never gained mainstream traction.\n\nWhatever Jaume was swinging in Tennessee could bode well for what comes next.\n\n\"adidas is a brand known for its innovation,\" he said. \"I have never had a paddle with a foam-injected core. Competing with the latest technology feels great.\"\n\nJaume has been the face of Six Zero for years, whose paddles feature a Gen-2 construction with a honeycomb polymer core.\n\nFor him, adidas bring a new scale, and some new tech, from a brand sponsor.\n\n\"I am a crafty player, he said, \"so adding a power side to my game opens up new weapons for me.\"\n\n",
    "published_at": "2025-08-15T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/08/Screenshot-2025-08-15-at-11.04.16---AM.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Pro Pickleball Shake-Up: Insights & Implications for New Player Contract Extensions",
    "headline": "Pro Pickleball Shake-Up: Insights & Implications for New Player Contract Extensions",
    "content": "\n\n\n\nThere are some massive things happening behind the scenes of professional pickleball that you probably didn’t know about, and they’re almost certainly going to lead to some players who are currently household pickleball names fading into obscurity by the end of 2026.\n\nRight now, players are renegotiating their contracts with the league, and these “Signed” graphics flying around social media are giving me flashbacks to the pickleball Tour Wars of 2023.\n\nAs of right now, we have some pretty big names that have signed their extensions –  like Anna Bright, Tyra Black, Federico Staksrud, and Hayden Patriquin – and some even bigger names that still haven’t – most notably, Ben Johns and Anna Leigh Waters.\n\nIf you don’t know what I’m talking about, in 2023, MLP and PPA were set to merge, but MLP launched a nuke and started signing players to multi-year deals.\n\nThe PPA responded by signing their own players, and chaos ensued. Players were sitting around hitting refresh on Instagram to see who was going to be announced next.\n\nOnce the dust settled, the two organizations ended up merging once again and founding the UPA that we know now.\n\nBut that was 2023. What the heck is going on now?! Are we in the middle of another Tour Wars type of situation?\n\nThe UPA is starting to renegotiate some of these inflated contracts and transition from fully guaranteed contracts to incentive-based prize money contracts. Some players have signed these extensions already and some haven’t.\n\nThe SparkNotes summary is this:\n\nThe kicker is access to vastly increased prize money amounts for PPA and MLP, including a $1,000,000 prize for the winning MLP team.\n\nYes, each player could individually take home $250,000, but they have to sign this extension.\n\nThe UPA has given Tour Wars signees (people who signed a MLP or PPA deal during late 2023) until August 15 to make a decision. Sign before then to have access to the “Gold” Prize money grid, where winners can take home up to 45,000 for winning a slam.\n\nSign by September 23rd to have access to the standard prize money grid, which pales in comparison to the gold grid. Winning the same tournament gets each player just $12,000 each, which is less than a third of the prize money available, but if you don’t sign this, you’re stuck with the futures prize money grid, which is about half of the standard prize money grid.\n\nFor winning the same tournament, you’d earn about $6,000 each. If this sounds aggressive, that’s because it kind of is. If you don’t sign anything at all, players will stay on their current contracts which run through the end of 2026.\n\nWith one day until the deadline, Jimmy Miller reported on X (formerly known as twitter) that several players have signed extensions.\n\nSome marquee names include:\n\nThere are still a lot of important names missing, and from what I understand, a certain threshold of players need to sign this extension in order to transition from guaranteed money to prize money.\n\nThe UPA has to avoid the following situation: Players with huge tour wars contracts staying on their guaranteed amounts while players with minimal guaranteed amounts transition to the huge prize money.\n\nThis is complicated, so I’ll take you through a quick example.\n\nLet’s say John Bens signed for $1,000,000 dollars per year during tour wars and Banana Wright signed for zero dollars. If John Bens refuses to sign the extension but Banana Wright does, the UPA could owe John $1,000,000 and Banana a ton of potential prize money, which would increase their liability instead of decreasing it.\n\nIt’s unknown how many players need to sign the extensions in order to transition to prize money, but right now we have a ton of notable names that haven’t been announced yet including Anna Leigh Waters, Ben Johns, The Johnsons, and more. I fully expect almost all of the top-ranked players to sign these extensions, and I signed mine a little while ago.\n\nIt’ll also be very interesting to see what happens to WPPA players. If you recall, the WPPA stands for World Pickleball Players Association and is led by Tina Pisnik, Collin Johns, Dekel Bar, Jessie Irvine, Jay Devilliers, and Gabe Tardio.\n\nIt’s unknown how many other players have joined the WPPA, and it’s unknown what joining the WPPA actually means, but my guess is that these players would most likely be the ones that would hold out on the negotiations with the UPA, if anybody decides to do so.\n\nInterestingly, the UPA also just announced two new players: Chris Haworth and Armaan Bhatia. Chris Haworth is the #1 ranked singles player on the APP Tour, and Arman is the top Indian player and has won a couple of APP events as well.\n\nI think that the UPA will get this done, but it’s going to be very interesting to see who signs in time and who walks away from professional pickleball.\n\nYou can follow Zane on X, YouTube and Instagram.\n\n",
    "published_at": "2025-08-14T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/08/upa-header-image.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "",
    "headline": "",
    "content": "",
    "published_at": "2025-08-20T07:38:48.831Z",
    "visuals": {
      "images": []
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "This Innovative Ankle Brace Is Purpose-Built for Pickleball",
    "headline": "This Innovative Ankle Brace Is Purpose-Built for Pickleball",
    "content": "\n\nPickleball is the perfect blend of competition and connection. A sport where you can challenge yourself to improve every time you hit the court while also making friends for life.\n\nPlay pickleball once and you'll love it. Play twice and you'll be hooked.\n\nFinding people to play with is easy. But, like any sport, avoiding injury can be a challenge, especially as we age.\n\nIn fact, we recently polled our audience on where they most commonly experience pain after playing pickleball. Of the more than 5,000 respondents, 20% said it was their ankles.\n\nIf you’ve ever rolled an ankle mid-match or felt that familiar twinge after a long day on the court, you’re not alone. Many pickleball players – especially those with a history of ankle injuries – are looking for smarter, more effective ways to protect themselves without sacrificing performance.\n\n\n\nWe've all laced up a crusty, plastic-feeling ankle brace or slipped on a restrictive neoprene version. While they're often better than nothing, they leave a lot to be desired.\n\nThe TayCo AthleticX Brace is built different. And it's trusted by serious athletes from the NFL to the NBA and everything in between.\n\nThe TayCo AthleticX Brace is lightweight and durable. It's designed with athletes in mind, allowing them to stay on the court longer, recover more effectively, and prevent ankle injuries without compromising movement.\n\n\n\nQuick lateral movements, fast pivots, and constant starts and stops can make even the most experienced players vulnerable to sprains, strains, or worse. And ankles are a common sore spot.\n\nThis brace is for players who want to protect themselves without sacrificing on-court performance.\n\nThe TayCo AthleticX Brace has been validated in clinical and professional settings.\n\nNow it's accessible for everyday athletes, like Stacey, an avid pickleball player:\n\nA post shared by TayCo Brace (@taycobrace)\n\n\n\nThe TayCo AthleticX Brace is the leading ankle support solution for pickleball athletes, engineered to stabilize the ankle without limiting mobility.\n\nIts lightweight, innovative design makes it:\n\nTayCo Brace products are regularly prescribed in clinical recovery settings and used proactively by athletes looking to prevent injury or re-injury and optimize performance.\n\nSays Dr. Brian Ratigan, Head Orthopedic Physician, University of Notre Dame Football & Baseball:",
    "published_at": "2025-08-13T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/07/TayCo-1.JPG"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "The 2025 APP Great Lakes Open Tournament Preview",
    "headline": "The 2025 APP Great Lakes Open Tournament Preview",
    "content": "The Greater Midland Tennis Center, in Midland, Michigan, is hosting the 2025 APP Great Lakes Open from August 13-17.\n\nThis is the eighth stop on the APP Tour in 2025, and looks to be a fun and exciting tournament.\n\n*All times Eastern\n\nCoverage is broadcast on APPTV YouTube, Court Sports Network and Facebook\n\nThe first two days of the tournament look to be ideal conditions. However, Saturday and Sunday look like they could be marred by rain in the evening (Saturday) and the morning (Sunday).\n\nA post shared by APP TOUR (@officialapptour)\n\nPrediction: Sewing beats Bobbi Oshiro in the finals to get back on the gold medal stand\n\nPrediction: I think something crazy happens in men’s singles, so I am going with Dustin Boyer over Ammar Wazir in the final\n\nIf your company is interested in reaching an audience of active pickleballers, you may want to give us a shout.\n\nA post shared by Reload (@reloadpickleball)\n\nPrediction: Purple Jesus and Christine Maddox beat Jill Braverman and Richard Livornese, Jr.\n\nA post shared by Y a n a   N e w e l l (@yana_pickleball)\n\nPrediction: Newell and Cederquist defeat Sewing and Oshiro in the finals\n\nA post shared by Engage Pickleball (@engagepickleball)\n\nPrediction: I am calling for some sort of craziness in men’s doubles as well, so I am going to pick Livornese and Tomassi over Len Yang and Thomas Yu in the finals",
    "published_at": "2025-08-13T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/08/APP-GL-Open.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Anna Leigh Waters and Ben Johns both Double Crown in Bristol - A Tournament Recap",
    "headline": "Anna Leigh Waters and Ben Johns both Double Crown in Bristol - A Tournament Recap",
    "content": "In the third PPA Tour event in the same amount of months, drama was high, upsets were huge, and so was the temperature and humidity.\n\nEnjoy the newsletter, subscribe today and receive the next issue straight to your inbox.\n\nThe Veolia PPA Bristol Open took place at the Bristol Sportsplex, in Bristol, Tennessee. It seems the hybrid model of tournament is locked in now, on the PPA Tour for Opens:\n\nLet's get into the action.\n\nAnna Leigh and Ben played a combined 36 doubles games (in gender doubles and mixed doubles) in Bristol, and went 33-3.\n\nThe most dominant performance on the weekend came from Anna Bright and Anna Leigh Waters in women’s doubles. They were a combined 11-0, never dropping a game. Their combined scoreline was: 121-22, or 11-2 average. They pickled teams three times, including a double pickle. The most points they gave up in a single game was six in the finals against Rachel and Jorja.\n\nA post shared by CARVANA PPA TOUR (@ppatour)\n\nNot to be outdone, Gabe Tardio and Ben Johns nearly made the same run as Anna and Anna Leigh. They only lost one game, which was in the semis, to Riley Newman and Jay Devilliers. Despite that one loss, here was their combined record together: 129-59, or 10.75-4.9 average, losing one game. They only allowed Matt Wright and Jaume Martinez Vich a TOTAL of nine points in their three game championship match.\n\nA post shared by CARVANA PPA TOUR (@ppatour)\n\nIn mixed doubles, Johns and Waters didn't have any problems before running up against JW and Jorja Johnson in the finals. They won in five games, 11-3 in the fifth. It seems like the Johnson siblings are the only team that can put up a fight against the best in the world. We will see if that changes throughout the rest of 2025.\n\n“Johnny G”, as the broadcasters called him all weekend, was a man on a mission.\n\nLet’s start out with this - John Lucian Goins is 17 years old. It was said multiple times on the broadcast that he is 16. He recently turned 17.\n\nA post shared by CARVANA PPA TOUR (@ppatour)\n\nNow that we have that out of the way, Johnny G took out some big time players. Here are his results from PPA Bristol, as the 19 seed:\n\nGoins is going to be dangerous moving into the second half of the year on the PPA Tour. The teen has what it takes to beat anyone in the world. I wouldn’t be surprised to see him crack the top 10 on the singles circuit by the end of the year.\n\nIf your company is interested in reaching an audience of active pickleballers, you may want to give us a shout.\n\nParris Todd won the PPA Tucson Open, back in February and added to her collection in Bristol.\n\nA post shared by CARVANA PPA TOUR (@ppatour)\n\nParris had to beat three top 10 seeds in order to win the title. She beat Mary Brascia, Brooke Buckner, and then Kaitlyn Christian, in the final.\n\nThe final was an epic display of competition from both Parris and Kaitlyn. In a two game match that couldn’t have been any closer, Parris won 12-10 in both games.\n\nMatt Wright and Jaume Martinez Vich made it all the way to Championship Sunday, earning a silver medal. This was the first medal for Wright in 273 days, while it was Vich’s first in 147 days. They beat Hayden and Fed in the quarters, 11-9, in game three. Then in the semis, they beat Tyson and Max Freeman, 11-7, 11-8 in games two and three, after getting pickled in game one.\n\nA post shared by Jaume Martinez Vich (@jaumemvich)\n\nDylan Frazier appeared to have injured his right hamstring in a singles match in the Round of 16 against Noe Khlif. He tried a sliding stop, extending his right leg, and came up limping and obviously hindered by the right leg. He still played mixed doubles and men’s doubles, but was in obvious pain. This is one to keep an eye on for the MLP Playoffs this week in San Diego.\n\nAnother thing to keep an eye on headed into the MLP Playoffs is Christian Alshon’s foot stomping. It is very strange and can throw opponents off. He nearly got called for it a couple of times in a match against Hayden Patriquin and Parris Todd. I believe he actually did get called for it as a distraction in his bronze medal match in mixed doubles.\n\nThe LifeTime ball is definitely benefitting some players, while others are a little slower to get used to playing with it. The ball definitely bounces higher and is great for players who hit precise ground stroke in singles, and those that like to pull speedups off the bounce in doubles. Keep an eye on future PPA events to see if this holds true.\n\n🥇 Parris Todd\n\n🥈 Kaitlyn Christian\n\n🥉 Brooke Buckner\n\n🥇 John Lucian Goins\n\n🥈 Gabriel Joseph\n\n🥉 Christian Alshon\n\n🥇 Anna Leigh Waters/Ben Johns\n\n🥈 Jorja Johnson/JW Johnson\n\n🥉 Anna Bright/Andrei Daescu\n\n🥇 Anna Bright/Anne Leigh Waters\n\n🥈 Jorja Johnson/Rachel Rohrabacher\n\n🥉 Parris Todd/Hurricane Tyra Black\n\n🥇 Gabe Tardio/Ben Johns\n\n🥈 Matt Wright/Jaume Martinez Vich\n\n🥉 Riley Newman/Jay Devilliers",
    "published_at": "2025-08-11T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/08/ABALW1.jpg"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Red Light, Green Light: Pro-Level Paddle Testing Is Coming to Amateur Pickleball Tournaments",
    "headline": "Red Light, Green Light: Pro-Level Paddle Testing Is Coming to Amateur Pickleball Tournaments",
    "content": "\n\nWe've all felt the pit in our stomachs when playing against someone with an objectively hot paddle.\n\nIt can be annoying in rec play. But come tournament time, it could mean the difference between copping some shiny new hardware or going home empty-handed.\n\nUntil now.\n\nEnter the Go-No-Go (GNG) Machine, a more portable and high-tech on-site paddle deflection testing device that's the new official choice for three major platforms:\n\n“Partnering with GNG Enterprises represents a major leap forward in our mission to ensure fairness and integrity for competitive play in pickleball,” said Jason Aspes, President of UPA-A.\n\nThe GNG Machine is a compact, on-site paddle deflection tester developed using the same standards set by UPA-A.\n\nPPA and MLP events currently use what's called the Pickle Press for on-site testing. In simple terms, a paddle is loaded into the machine then tested to see how many pounds of force are required to compress the core 1/16 of an inch.\n\nA paddle passes if the force is above the established threshold. It fails if it's below. This is commonly referred to as the \"trampoline effect.\" Generally speaking, the easier it is to compress a paddle's core, the faster a ball can deflect off its face.\n\nThe GNG Machine can test a paddle in under 60 seconds. A green light means it passed. A red light indicates it failed.\n\nThe Pickle Press is housed inside a large black case and weighs nearly 200 pounds. The GNG Machine, on the other hand, is considerably smaller and weighs just 12 pounds.\n\nUPA-A, the governing body for the United Pickleball Association, which runs the Carvana PPA Tour and Major League Pickleball, will be rolling out the GNG Machine across its premier events, including:\n\nBut it's not just for pro play.\n\nDUPR will implement the GNG Machine at its top-tier clubs and sanctioned amateur tournaments, a major advancement in a facility's willingness and ability to quickly and accurately ensure every paddle on the court meets deflection standards.\n\n“We’re proud to announce the GNG Machine as the official and exclusive on-site testing device for DUPR-sanctioned tournaments,” said Tito Machado, CEO of DUPR.\n\nLastly, Pickleballtournaments.com hosts thousands of amateur events around the country and has also designated the GNG Machine as its official and exclusive paddle deflection testing partner.\n\nThis integration empowers tournament directors to proactively enforce compliance, ensuring all participants are playing with standardized equipment.\n\nOn-site implementation for pro and amateur play is expected to commence this month, expanding across the U.S. and internationally to countries like Australia, India, Malaysia, South Korea, Vietnam, China, and Canada.\n\nA full list of participating tournaments and clubs will be announced in the coming weeks.",
    "published_at": "2025-08-13T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/08/Go-No-Go.jpeg"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Zane Navratil Finger Wags Fox News Host Griff Jenkins on Live TV",
    "headline": "Zane Navratil Finger Wags Fox News Host Griff Jenkins on Live TV",
    "content": "\n\nOf all the places to play pickleball, inside NYC's Grand Central Terminal has to rank toward the top.\n\nIn celebration of National Pickleball Day – that's today, Friday, August 8 – CityPickle brought that dream to life, putting a fresh court inside the iconic Vanderbilt Hall.\n\nPros Genie Bouchard and Zane Navratil were on hand, along with NFL legend Chad Ochocinco, Jeff Watson, the Senior Vice President of Communications for the United Pickleball Association, and the two founders of CityPickle, Mary Cannon and Erica Desai.\n\nIt was all fun and games, right up until Fox News host Griff Jenkins decided to test Zane's hands on live TV.\n\nZane ripped a winning counter between Jenkins and Ochocinco, then proceeded to finger wag Jenkins right off the court.\n\nLMAO Zane just buried a Fox News host on live TV as he tried to close out the segment  Chad Ochocinco as the random 4th is so funny. Matumbo finger wag…nice touch📍MLP x City Pickle popup in Grand Central Station pic.twitter.com/ihbUAS66Y8\n\nCityPickle's Central Park location will play host to the Major League Pickleball Finals on August 22-24. The company also just announced a new facility and corporate headquarters in the Paramount Building in Times Square.\n\n",
    "published_at": "2025-08-08T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/08/Screenshot-2025-08-08-at-12.30.53---PM-1.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Little League World Series Slugger's Favorite Athlete: Ben Johns",
    "headline": "Little League World Series Slugger's Favorite Athlete: Ben Johns",
    "content": "\n\nThe Little League World Series is one of the most wholesome sporting events of the year. Taking place annually in Williamsport, PA, it unites talented tikes from 20 teams around the world to battle it out for the coveted title of World Series Champions.\n\nThe on-field talent is astounding, but many of the highlights often come from getting to know the quirks of the many young, international personalities.\n\nJaxon Lisle from Oklahoma, for example, listens to \"In the Air Tonight\" by Phil Collins to pump himself up before each game.\n\nHolden Disselkoen of Texas East offers a more traditional anecdote, listing Fernando Tatis Jr. as his favorite MLP player.\n\nThen there's his teammate Michael Frankie, a 12-year-old who towers four-feet, 10-inches and who listed a more unorthodox favorite athlete: Ben Johns.\n\nThe broadcast had to add \"Pickleball Player\" in parenthesis so viewers would have any idea who Ben Johns even is.\n\nApparently, Frankie plays a ton of pickleball himself.\n\nConsider us Texas East fans.\n\nTexas East would go on to lose to Louisiana 7-2 in the Southwest Region Semifinal.",
    "published_at": "2025-08-05T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/08/Screenshot-2025-08-05-at-8.35.13---AM.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Chicago Suburb Sets 'Unofficial World Record' for Largest Pickleball Lesson",
    "headline": "Chicago Suburb Sets 'Unofficial World Record' for Largest Pickleball Lesson",
    "content": "\n\nMark Miller has been teaching kids to play tennis in the Chicago area for nearly 20 years. More recently, he's added pickleball to his playbook.\n\nAnd this year, he decided to spread the word in grand fashion.\n\nA reported 484 kids ages 5 through 13 participated in a pickleball lesson led by Miller Monday at the Danny Cunniff Park pickleball complex in Highland Park, Illinois, located about 25 miles north of downtown Chicago.\n\nThe event was a joint project between Mark Miller's Munchkin Programs for youth sports education, the Park District of Highland Park, and MLP's Chicago Slice.\n\n\"I made a living teaching tennis to little kids,\" Miller told ABC 7 Chicago. \"I think pickleball's a lot easier to learn.\"\n\nIt’s being lauded as an “unofficial world record” — besting Miller’s previous mark of 300 participants in Arizona in 2023.\n\nMembers of the Chicago Slice organization were on-hand to support the event, providing nearly 100 paddles to help make it all happen.\n\n\"Supporting initiatives that get kids on the court, learning the game, and building confidence through sport is a key part of our mission to elevate pickleball,\" said Maddie Moeke, COO of the Chicago Slice. \"We’re proud to help grow the next generation of players right here in the Chicago area.”\n\nThe brainchild of lifelong youth advocate Miller, Munchkin Programs:\n\nThe Danny Cunniff Pickleball Complex includes six dedicated courts and will play host to the 2025 APP Chicago Open pickleball tournament from August 27-31.",
    "published_at": "2025-07-23T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/07/Screenshot-2025-07-23-at-9.44.29---AM.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Highlights: Anna Leigh Waters Gets Real on ESPN's SportsCenter",
    "headline": "Highlights: Anna Leigh Waters Gets Real on ESPN's SportsCenter",
    "content": "\n\nWaters sat down with host Christine Williamson onsite from the MLP Mid-Season Tournament to address the pickleball haters, the pressure she feels as the world no. 1, and her Olympic dreams.\n\nThe interview was a much-hyped appearance as part of ESPN's  \"50 States in 50 Days\" tour.\n\nWaters is competing to defend her team’s title at the Major League Pickleball Mid-Season Tournament in Grand Rapids, MI, and remains focused but optimistic: “I’m just taking it kind of match by match, but I know we’ve won it before, so we can win it again,” she told host Christine Williamson.\n\nWatch the goat 🐐 on ESPN2! 🙌 Live interview with Christine Williamson! 🎤 @AnnaLeighWaters @itsthebaldgirl @espn @SportsCenter pic.twitter.com/66ZPmfo3Np\n\nDespite her dominance, Waters admitted she was once a skeptic: “Before I started playing, I was honestly one of those doubters. Once I got on the court, I was like, 'I get the hype.'”\n\nWaters fielded the question everyone expected: What do you say to those people who question whether pickleball is a real sport?\n\nShe credited pickleball’s rapid rise to its accessibility and community: “Any age, any gender can play. When I was 10 years old I was playing with my 70-year-old grandfather.”\n\nAs for the pro tournament vibes: \"Immaculate,\" she said, encouraging anyone who hasn't already to get out and experience the sport in person for themselves.\n\nWaters also dreams of an Olympic debut for the sport: “Selfishly, it would mean a lot to me because I would love to compete and represent the US … but for pickleball, I think it would be huge. It would add another level.”\n\nFinally, despite the constant pressure of being world no. 1, Anna Leigh credited pickleball with growing as a person.\n\n\"I'm just having a blast and enjoying every moment of it,\" she said.\n\nWatch the full interview below:",
    "published_at": "2025-07-11T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/07/Screenshot-2025-07-10-at-7.04.23---PM.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Exclusive: PPA CEO Connor Pardoe Says Automated Line Calls Are Coming to Pro Pickleball",
    "headline": "Exclusive: PPA CEO Connor Pardoe Says Automated Line Calls Are Coming to Pro Pickleball",
    "content": "\n\nPPA CEO Connor Pardoe joined the PicklePod to chat with host Zane Navratil about a number of timely topics, including the new incentive-based contract model rolling out to pros for the next three years and what it means for pickleball's bright future.\n\nHe also used the opportunity to break a little news: Automated line calling is coming to professional pickleball.\n\nThe $15 million in prize money for the new pro contracts catches all the headlines, but there is an adjacent facet of the push to make the sport more equitable that's critical to \"turning this thing into a billion-dollar business,\" as Pardoe said: How the league will address cheating.\n\nZane laid out the worst offenders, and Pardoe addressed each in turn:\n\nThat last one, automated line calling, is a big deal.\n\nPros calling their own lines is arguably the biggest hurdle facing the sport's legitimacy and growth, right after paddle regulation (which feels like it's more in check these days).\n\nHardly a pro tournament goes by without an egregious line calling making headlines. Just recently, for example, pro Travis Rettenmaier admitted to calling a ball than landed two feet inside the baseline out \"on purpose\" – payback for a bad line call committed by the other team a few points earlier.\n\nIt's an eye-for-an-eye mentality that can swing the momentum of a point, game or entire match. It needs to be addressed once and for all before the sport gets a major media rights deal, or can reap the financial benefits of wholesale sports betting, or finds itself in the Olympic Games.\n\nThis is a huge step in that direction.\n\nAs Zane so eloquently put it in response to hearing the news for the first time: \"Wow. Holy Crap. That's some news.\"\n\nPardoe says the shift to a prize-based contract model is a win-win for the 95% of the players, and was designed with heavy player input along the way.\n\nThere is a ton of nuance here, but a few highlights to keep top of mind:\n\nThe goal, says Connor, is a model that's equitable and fair – the more you win, the more you earn.\n\n\"You can't have a pro sport without the best talent,\" Connor said. \"We need the buy-in from the best players to want to be here and want to grow the sport.\"\n\nContracts are critical, said Pardoe, for a few reasons.\n\nWatch the full episode below:",
    "published_at": "2025-07-02T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/07/LINE-CALLS-3.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "New Global Merger Tackles Pickleball Olympic Bid: 'Our Biggest Problem Has Been Us'",
    "headline": "New Global Merger Tackles Pickleball Olympic Bid: 'Our Biggest Problem Has Been Us'",
    "content": "\n\nPickleball's rightful spot in the Olympic Games has been argued over since long before most people picked up a paddle during COVID. But a few major developments makes its prospects feel more real than ever.\n\nFirst, some eye-opening numbers have emerged from a new UPA Asia study, which puts the number of people across 12 Asian territories playing pickleball at least once per month at a seismic 282 million.\n\nAnd just last week, two global organizations – the World Pickleball Federation (WPF) and International Pickleball Federation (IPF) – merged into one entity, with a primary focus of positioning pickleball as the fastest-growing sport not just in America, but the world.\n\nIt's a big step toward Olympic recognition. Here's what comes next.\n\nTo be considered as a member of the International Olympic Committee (IOC) and participate in the Olympics Games, WPF Founder Seymour Rifkind said on the latest PicklePod, a sport needs to be represented by a sole international federation.\n\nIt's a rigorous process, designed to weed out all but the most serious of prospective members. Rifkind and the WPF, he says, are very serious.\n\n\"There's probably about 300 to 400 pages of documents that need to be put together in order to formally apply to the IOC,\" he told PicklePod host Zane Zavratil.\n\nThat's about three or four more months of work to get together. During that time, the new entity needs to hire a CEO and a COO, amass an army of volunteers, and come up with a new name.\n\nThen, it needs to show the IOC that pickleball is the global juggernaut it claims to be.\n\n\"One of the biggest next steps once a new board is put into place in August and our committees are filled out is hosting a World Pickleball Games,\" said Rifkind. \"One of the things that the IOC is going to want to see, 'OK, so you've got all these countries, it's popular. Now, can you run a major international tournament?\"\n\nLast week, member countries of the WPF and IPF met and voted unanimously to unify into a single international governing body.\n\nThe unified entity –  made up of more than 100 countries, says Rifkind – will uniquely continue to champion “One Country One Vote” – ensuring proper representation for all nations.\n\nTo align with the global sports community and meet the highest standards of governance, the new WPF will register its headquarters in Lausanne, Switzerland — home to the International Olympic Committee (IOC).\n\nIt's also committed to meeting all IOC recognition requirements, including:\n\nRikind cited some eye-opening stats on the PicklePod as evidence of the sport's continued international growth.\n\nA new study conducted by UPA Asia and YouGov Singapore surveyed more than 14,000 respondents across 12 territories: China; Chinese Taipei; India; Indonesia; Japan; Malaysia; the Philippines; Singapore; South Korea; Hong Kong, China; Thailand and Vietnam.\n\n\"The sampling was done based on a territorially representative sample of each territory, with at least 1,000 respondents per market. The responses were then extrapolated based on population size,\" according to UPA Asia.\n\nSome key findings from the 12 representative territories:\n\nIn terms of frequent players –  defined as those who play at least once per month – India tops the list (178 million), followed by China (over 60 million) and Vietnam (over 16 million).\n\nDespite the momentum established by the WPF-IPF merger, pickleball's Olympic bid isn't quite so cut and dry.\n\nSince 2023, a third organization has been championing the sport's growth on the international level: the Global Pickleball Federation.\n\nAnd just a few days ago, it posted this to Instagram, from a location you may recognize – Lausanne, Switzerland:\n\nThe GPF, which is supported by USA Pickleball, says the plans are in motion \"to accelerate pickleball’s future at the highest level of competition on a global scale.\"\n\nRifkind doesn't share their enthusiasm, calling this \"a lot of smoke and mirrors.\"\n\n\"The Global Pickleball Federation, for all of their talk, their bylaws are not IOC compliant,\" he said.\n\nA post shared by USA Pickleball (@usapickleball)\n\nNot surprisingly, the biggest hurdle standing in the way of pickleball's adoption as an Olympic sport, says Rifkind, is pickleball itself.\n\nUntil now, there were three fragmented governing bodies on the global level (the Global Pickleball Federation is the third), and nobody at the helm.\n\nThis merger, he contends, changes that.\n\n\"The International Olympic Committee, I can tell you, loves pickleball,\" says Rifkind. \"It checks all the boxes of what they're looking for for any new sport to be accepted. Our biggest problem has been us.\"\n\nA new board is now working on updated bylines, adhering to the IOC's mantra of every country getting one vote.\n\nAs for when pickleball could feasibly be in the Olympics?\n\n\"There is still a possibility that we could get in 2028,\" Rifkind contends, though he puts the likelihood below 25 percent. \"People say it's impossible. I've heard this directly from the IOC: 'If we want you in, you're in. Period.'\"",
    "published_at": "2025-06-26T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/06/IPF-WPF-Merger-1.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Zane Navratil Named President of Pickleball's Pro Player Committee",
    "headline": "Zane Navratil Named President of Pickleball's Pro Player Committee",
    "content": "In a significant move for professional pickleball, Zane Navratil has been elected President of the UPA's Pro Player Committee. This role, established under the United Pickleball Association (UPA), the joint governing entity of the PPA Tour (PPA) and Major League Pickleball (MLP), marks the most substantial effort to date toward unified player representation in the sport.\n\nThe UPA Pro Player Committee is intended to provide a direct, organized player voice within the fast-growing structure of pro pickleball.\n\nPickleball’s explosive growth has outpaced its organizational infrastructure. While individual pro tours like the PPA and MLP have offered player councils or advisory groups in the past, a cohesive, player-first body with teeth has been elusive. There have been murmurs of player unions before, but no group has successfully gained traction across both tours.\n\nAs The Dink reported earlier this year in “Pickleball Pros Organize New Players Association,” the need for unified representation has become increasingly urgent as questions of scheduling, travel demands, and business interests of tours increasingly impact athletes’ careers and well-being. The creation of the UPA itself was a step toward streamlining pro pickleball; this committee represents a parallel step for the players.\n\nThat Zane Navratil was the choice to lead the committee is telling. A decorated pro with titles across both MLP and PPA, Zane has become one of the sport’s most respected voices, not just among fans, but among his peers.\n\nIt’s not hard to see why players rallied behind him. In addition to being a top competitor and team captain for the MLP’s New Jersey 5s, Zane wears multiple hats: he’s a partner at Paddletek and ProXR Pickleball, co-creator of an international clinic platform, and a leading content creator. But it’s his role as co-host of PicklePod, The Dink’s flagship podcast, that’s helped shape his reputation as a thoughtful, informed leader.\n\nThrough PicklePod, Navratil has gone beyond on-court excellence, regularly offering insight on the business, strategy, and politics of pickleball. He’s not afraid to tackle controversial topics or push for greater transparency. Whether he’s breaking down paddle tech standards, dissecting the economics of pro tours, or just riffing on the chaos of a tournament weekend, Zane brings authority and humor to the mic. It’s earned him trust, and a dedicated following.\n\nIn 2023, he was awarded The Dink’s “Most Influential Voice in Pickleball,” and he remains a recurring nominee across multiple categories each year.\n\nUnlike traditional player unions in sports like the NBA or MLB, the UPA Pro Player Committee is not built to be adversarial—at least not initially.\n\n“It’s time for a collaborative, solutions-oriented voice at the table—one that works with the UPA rather than against it,” Navratil wrote. “My goal is to advocate for smart, actionable improvements that elevate the player experience without disrupting operational sustainability. This role isn’t about conflict—it’s about constructive progress.”\n\nNavratil’s professional background in accounting may also lend credibility as he engages with league executives and sponsors. He appears eager to balance pragmatism with advocacy.\n\nWith 167 UPA players reportedly participating in the vote, the election alone shows a growing appetite for formal representation. Still, the Committee’s power will be defined less by its structure and more by the credibility and consistency of its leadership.\n\nZane, with his rare blend of on-court success, business acumen, and media fluency, may be uniquely positioned to give pro pickleball players something they’ve never truly had: a unified, respected voice at the table.\n\nAs he put it: “Let’s get to work.”",
    "published_at": "2025-07-27T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/07/Screenshot-2025-07-27-at-4.04.29---PM.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "The Beer City Open - One of the Best Events in Pickleball",
    "headline": "The Beer City Open - One of the Best Events in Pickleball",
    "content": "The Beer City Open (BCO) is the best amateur pickleball tournament in the pickleball world, and it’s not close.\n\nIt is also hosting the Major League Pickleball (MLP) Mid-Season Tournament at the same time this year, for the second year in a row.\n\nInitially, I had plans on being in Grand Rapids this week to cover the Beer City Open and the MLP Mid-Season Tournament, but life got in the way. I have had some serious FOMO this week.\n\nThe BCO started in 2018, with pro Andrea Koop, convincing Grand Rapids local, Paul Richards, to start running a tournament. Back then, there were 400 participants, and $12,500 in prize money. This was HUGE in those days.\n\nThis was before any of the pro tours existed, and the BCO instantly became one of the best pro tour stops each year.\n\nRichards is very well known in the area for putting on some of the best pickleball amateur tournaments in the country, but the BCO is its own beast. The entire operation is a year-round project for Richards and his staff.\n\nThe Beer City Open has maintained its credibility, so much so that Major League Pickleball has partnered with the event in both 2024 and 2025. From 2018 to 2023, the Beer City Open was one of the very few tournaments that was completely independently run, that most pro players attended and looked forward to.\n\nThe tournament has grown to well over 1,000 players, and was sold out within minutes of posting registration for 2025. There was a lottery system, which ran from April 10th through April 13th for amateurs. Additionally, the prize money has continuously increased, to now being well over $100,000, in 2023.\n\nIn fact, the amateur play is some of the toughest in the country. The BCO only offers 3.5, 4.0, 4.5, and 5.0 skill level brackets. No 2.5 or 3.0 brackets here!\n\nAnother unique thing about the BCO is its charitable donations. The tournament has donated more than $150,000 to the Belknap Enhancement Fund, a 501(3)c charity. The fund helps make improvements to Belknap Park, which is the host site for the BCO.\n\nThe BCO donations have helped to enhance lighting throughout the facility, and even helped add six courts.\n\nIn 2009, Charlie Papazian created the Beer City USA poll to measure “community spirit and support for beer businesses” when America was in a craft beer revolution.\n\nWith over 40 craft breweries within the 30 miles of each other in the Grand Rapids area, it quickly shot up the charts in the poll.\n\n\n\nThe 2012 Beer City USA poll labeled Grand Rapids as the top Beer City in the USA, and in 2013, Papazian retired the poll. So Grand Rapids can technically always claim the title of Beer City, since the poll ended with the city on top.\n\nThe tournament directors, volunteer coordinators, and volunteers are the best.\n\nIt is a two pronged approach for Koop and Richards. Richards handles the vast majority of the logistics and amateur play, while Koop focuses on the pros.\n\nEverything is thought of.\n\nAmateur divisions don’t overlap with others, so a player isn’t stuck at the park for 8+ hours like some tournaments.\n\nKoop makes sure hotel room blocks are taken care of for pro players and that the hotel is within walking distance of the park.\n\nIn fact, Koop recently went on the PicklePod Podcast with Zane Navratil to talk more about the BCO, and ESPN actually covering the event this year:\n\n\n\nEach day there are four or five food trucks, and you guessed it - beer vendors. However, spectators and players are allowed to bring in their own food and drinks.\n\nIn addition to Koop and Richards, Nichole Miller is the volunteer coordinator for the event. If you have ever been to a pickleball tournament, large or small, you know the volunteers are crucial. Miller has over 400 volunteers this year and without her logistical support, the tournament would not run nearly as smoothly.\n\nOther tournaments throughout the country are usually begging for volunteers and need more at the last minute because they didn't get enough initially. Not BCO. Volunteers come from near and far to be a part of this special tournament.\n\nThe BCO continues on throughout the week, ending on Sunday. You can watch the MLP Mid-Season Tournament broadcast live on pickleballtv and the pickleballtv app. However, if you are able to get to Belknap Park in Grand Rapids, Michigan this weekend, do everything in your power to make it happen. You won't regret it.",
    "published_at": "2025-07-11T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/07/Paulandkoop.jpg"
      ]
    },
    "category": "pickleball",
    "approved": false
  },
  {
    "title": "Boiling Point: Pro Pickleball's Line Call Problem Needs to be Addressed",
    "headline": "Boiling Point: Pro Pickleball's Line Call Problem Needs to be Addressed",
    "content": "Etienne Blaszkewycz and Travis Rettenmaier got into a heated exchange on Wednesday in a Round of 32 men’s doubles match at the PPA Select Medical Orange County Cup. The dispute was over, you guessed it - line calls.\n\nThis is not a new issue for pro pickleball. In fact, Zane Navratil, Thomas Shields, and Federico Staksrud talked about it on the PicklePod podcast in early March.\n\nThe crux of the problem? There are no video challenges on side courts. I am a huge fan of the side courts being streamed, which is what the PPA Tour has done this year. Pickleballtv and the Pickleballtv app have been streaming Championship Court, Grandstand Court, Showcase 1, Showcase 2, Showcase 3, and Showcase 4.\n\nIn addition, the PPA Tour has created another YouTube channel, PPA Streamed Courts, that streams several courts throughout the event.\n\nFirst and foremost, this article is not meant as a character defamation of any player mentioned here. This is an issue that continues to come up and this event is just the most recent one to occur.\n\nOn Wednesday, in the Round of 32, (11) Travis Rettenmaier and Connor Garnett squared off against qualifiers, (44) Callan Dawson and Etienne Blaszkewycz.\n\nAt 2-5-2 in the first game, with Blaszkewycz serving to Rettenmaier, a long rally ended with a overhead put away from Rettenmaier, or so he thought.\n\nBlaszkewycz called it out, and immediately both Garnett and Rettenmaier were very animated that it was in. The referee said he didn’t see enough to overturn the call. A lot of back and forth happened, with the out call eventually standing, so Etienne and Callan won the point.\n\nThe link above directs you to the exact moment this first call was made. A slowed down still frame of the call:\n\nThe ball appears to be on the way up, in this still frame, directly after the Rettenmaier overhead. However, we were unable to find a still frame where the ball directly hit the ground.\n\nRettenmaier and Garnett would go on to win the first game, 11-3. In game two, Rettenmaier was still upset about the call that Blaszkewycz made. At 2-0-2, with Rettenmaier serving, Blaszkewycz put away an overhead through the middle.\n\nA still frame of the ball that Rettenmaier called out:\n\nAgain, the referee said he didn’t see the ball well enough to overrule, so the out call stood.\n\nRettenmaier and Garnett would go on to win 11-5 in the second game, moving on to the Round of 16.\n\nAfterward the match was over, Rettenmaier and Blaszkewycz exchanged some pleasantries, but nothing got super confrontational.\n\nIf your company is interested in reaching an audience of active pickleballers, you may want to give us a shout.\n\nAfter the match, California Black Bears President and GM, and podcaster, Jimmy Miller posted the Rettenmaier out call on his Instagram stories joking with Rettenmaier about the call.\n\nThere was an incident last year between the Black Bears and the Florida Smash in Major League Pickleball (MLP). Rettenmaier and Miller were part of that match, where the Black Bears made a bad line call in the MLP Mid-Season Tournament last year, and that was brought up.\n\nAfter the match between Rettenmaier/Garnett and Blaszkewycz/Dawson, Miller posted the Rettenmaier call on his IG story, and Rettenmaier responded:\n\nOn all other courts other than Grandstand and Championship Court, there are no video replays or challenges. If a player calls a ball out and the referee doesn’t see the ball, there is no consequence for cheating, at the moment.\n\nAs the PPA Tour moves toward bringing sports betting into the game, these things need to get cleaned up. Sure, close calls happen in other sports all the time. Calls are scrutinized and reviewed. However, no such thing exists right now.\n\nAdditionally, with rumors swirling about the PPA Tour moving toward a model heavily focused on prize money in the next year or two, this issue will become more divisive.\n\nThere are a few possible solutions to this problem. The list below is in order from least likely and/or feasible to most likely and/or feasible.\n\nThis is just not feasible for several reasons. First, most players trust their own eyes versus line judges. Secondly, on side courts, many times room is at a premium, so there is likely not enough room to do this.\n\nThe problem with this option is that it is a deterrent, but doesn’t really have live play implications. In a Round of 64 match, does it really matter if someone lost on a bad call, but a week later, the team that won gets fined for a bad line call?\n\nWith multiple cameras on every court, along with a centralized video review system, the calls may not all be perfect, but it would be a big step forward. Being able to challenge a call on every single court, in an efficient manner, seems to be the only way to fix the problem.\n\nThis subject seems to come up every few months, with an egregious line call. The Sorry Not Sorry podcast consistently publicly shames players who make bad line calls on a weekly, but it doesn’t seem to be enough. Players are still making very bad line calls.\n\nHopefully pro pickleball can figure out a solution to the problem, otherwise these cases of cheating on line calls are going to persist.\n\n",
    "published_at": "2025-06-20T00:00:00.000Z",
    "visuals": {
      "images": [
        "https://www.thedinkpickleball.com/content/images/size/w1198h576/2025/06/Screenshot-2025-06-20-at-1.51.12---PM.png"
      ]
    },
    "category": "pickleball",
    "approved": false
  }
]