[
  {
    "url": "https://www.padelfip.com/2025/08/gran-canaria-castello-rufo-and-jimenez-sanchez-win-title-and-150-points-in-fip-ranking/",
    "headline": "Gran Canaria, Castelló-Rufo and Jimenez-Sanchez win title and 150 points in FIP ranking",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/News-Gran-Canaria-1024x576.jpg"
      ]
    },
    "published_at": "August 17, 2025",
    "content": "Jessica Castelló and Lorena Rufo in the women’s draw, José Jimenez and Maxi Sanchez Blasco in the men’s. The FIP Gold in Gran Canaria, the second in a row played in August after Potosí (Mexico), has crowned its winning pairs. In the women’s final, Castelló and Rufo conceded only five games to Raquel Eugenio and Jimena Velasco (6-3, 6-2), concluding an extraordinary weekend that saw them win five matches all in two sets. “We gave it our all and managed to win – said the winners –. We knew it would be a very difficult match against two very strong players, but we are happy with our work and the result”. For Castelló, this is her second victory in Gran Canaria after the one in 2021, her ninth overall in a CUPRA FIP Tour tournament.\n\n\n\nThe men’s final was more fought in a tournament full of surprises. The winners were José Jimenez and Maxi Sanchez Blasco, seeded no.6, who came back from a set down to win 4-6 6-3 6-3 against Tonet Sanz and Marc Quilez. “We felt at home playing here, and it’s a great satisfaction for me to have won here after last year’s final”, said Jimenez, who was defeated in the decisive match in 2024 alongside Jairo Bautista and thus got his revenge.\n\n"
  },
  {
    "url": "https://www.padelfip.com/2025/08/gran-canaria-day-2-here-are-the-pairs-that-will-compete-for-the-titles/",
    "headline": "Gran Canaria, day 2. Here are the pairs that will compete for the titles",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/News-gold-3.1-1024x576.jpg"
      ]
    },
    "published_at": "August 17, 2025",
    "content": "After a very long day, which saw the quarter-finals and semi-finals played, the FIP Gold Gran Canaria is ready to crown its winners. In the men’s draw, the number 6 and 5 seeds will compete for the title. At the top, José Jimenez and Maxi Sanchez Blasco, after coming back from a set down in the quarter-finals against Insa/Roglan, defeated Adrian Marques and Marc Sintes 6-3 6-4, and will face Tonet Sans and Marc Quilez, who also had to come back in the quarter-finals against Pineda/ Gonzalez before beating Miguel Lamperti and Juani De Pascual 6-4 7-5.\n\n\n\nIn the women’s draw, meanwhile, the final will be between the top two seeds: both Jessica Castelló and Lorena Rufo (1) and Raquel Eugenio and Jimena Velasco (2) reach the decisive match, which offers 150 points in the FIP ranking for the winners, without losing a set. Castelló/Rufo eliminated Manquillo/Lujan in the semi-final with a score of 7-5 6-3, while Eugenio/Velasco defeated Perez/Borrero 7-5 6-0.\n\n"
  },
  {
    "url": "https://www.padelfip.com/2025/08/gran-canaria-day1-so-many-surprises-in-the-mens-draw-todays-quarter-finals-and-semi-finals/",
    "headline": "Gran Canaria, day1. So many surprises in the men’s draw. Today’s quarter-finals and semi-finals",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/DAY1-GOLD-GRAN-CANARIA-1024x576.jpg"
      ]
    },
    "published_at": "August 16, 2025",
    "content": "The men’s draw at the FIP Gold in Gran Canaria kicked off with a bunch of surprises. Five of the eight seeds were knocked out in the first two rounds played yesterday: Ferran Insa and Albert Roglan eliminated the number 1 seeds Nachi Sager and Mario Ortega in the first match of the day, while Diego Gil and Javi Ruiz (3) suffered the same fate, losing 2-6, 6-3, 6-4 to French qualifiers Benjamin Tison and Timeo Fonteny. The number 2 seeds Denis Perino and Facundo Dominguez held on, although they had to come back from a set down in the second round before beating two other Frenchmen, Julien Seurin and Manuel Vives, 6-7, 6-4, 6-4.\n\n\n\nThe women’s draw went according to plan, with the eight seeds qualifying for today’s quarter-finals, as well as the semi-finals: Castelló/Rufo-Gomez/Navarro, Manquillo/Lujan-Navarro/Fassio, Perez/Borrero-Ortiz/Dal Pozzo and Perez/Vano-Eugenio/Velasco are the four matches scheduled, which will determine the four pairs that will also be on court in the afternoon."
  },
  {
    "url": "https://www.padelfip.com/2025/08/gran-canaria-sager-ortega-and-castello-rufo-are-the-pairs-to-beat/",
    "headline": "Gran Canaria, Sager-Ortega and Castelló-Rufo are the pairs to beat",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/News-gold-canarie-1024x576.jpg"
      ]
    },
    "published_at": "August 14, 2025",
    "content": "From Friday to Sunday, after the end of the qualifying rounds, Gran Canaria (Spain) will host the second consecutive FIP Gold tournament, the fourth of the season, with 150 points up for grabs for the winning pairs. There will be two draws over the weekend, both with 32 pairs. In the men’s draw, the number 1 seeds will be Nachi Sager (number 43 in the FIP rankings) and Mario Ortega (75), followed by Italians Denis Perino and Facundo Dominguez.\n\n\n\nIn the women’s draw, the highest-ranked players among all those registered in Gran Canaria are Jessica Castelló (16) and Lorena Rufo (24), who lead a seeding that sees Raquel Eugenio and Jimena Velasco as the number 2 seeds. The first two rounds will be played on Friday, with the quarter-finals and semi-finals on Saturday and the finals scheduled for Sunday.\n\n\n\n"
  },
  {
    "url": "https://www.padelfip.com/2025/08/vilamoura-summer-cup-touly-and-fassio-aim-for-another-win-in-portugal/",
    "headline": "Vilamoura Summer Cup, Touly and Fassio aim for another win in Portugal",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/NEWS-1024x576.jpg"
      ]
    },
    "published_at": "August 14, 2025",
    "content": "Moya-Araujo for the men, Touly-Fassio for the women: these are the top-seeded pairs in the FIP Bronze Vilamoura, as the CUPRA FIP Tour stays in Portugal after last week’s events, the FIP Silver and FIP Bronze in Portimao.\n\n\n\nIn the women’s tournament, the French-Spanish pair is the top seed. They just won the FIP Bronze Island Padel Jersey last week. On the other side of the draw is the team of Lea Godallier, who already won a FIP Bronze in Agrigento and a FIP Silver Port de Bandol this year, and Dora Andrejszki, who was a finalist at the FIP Bronze in Alexandria, Egypt.\n\n\n\nIn the men’s seeding, behind Spanish player Moya and local player Araujo, is the pair of Manuel Castano (winner of four CUPRA FIP Tour titles in 2025) and Samuel Rivas (finalist in the FIP Bronze Cordenons)."
  },
  {
    "url": "https://www.padelfip.com/2025/08/young-talents-ready-to-conquer-the-world-tournaments-in-three-different-continents/",
    "headline": "Young talents ready to conquer the world: tournaments in three different continents",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/News-Promises-14-1024x576.jpg"
      ]
    },
    "published_at": "August 14, 2025",
    "content": "The 2025 season of the FIP Promises tour continues, and this weekend there are three more events in Spain, Egypt, and Brazil: the FIP Promises Diputacion Barcelona, the FIP Promises Campo Largo, and the FIP Promises Egypt III. The young padel talents are ready to shine again across these three countries in Europe, Africa, and South America.\n\n\n\nIn the Malaga tournament, boys and girls will compete in Under 12, Under 14, Under 16, and Under 18 categories. In the youngest group, top seeds are Salvador Condenso-Xavier Ré and Marta Bolivar-Adriana Sanchez. In the Under 14, we have Mario Brocal-Ian Garcia and Claudia Ferrer-Ona Calvo. In the Under 16, again Mario Brocal-Ian Garcia and Amaya Sánchez-Carla Hernandez are leading. For the Under 18, the top pairs are Guillermo Fernández-Sergio Tierno and Laura Ferrer-Andrea Arcos.\n\n\n\nYoung talents have also signed up for the tournament in Campo Largo, where the Under 12, Under 14, and Under 16 categories will be played. Among the youngest, Alexandre Grings-Otto Lodovico lead the draw. In the Under 14, the top team is Felipe Castillo-Baltazar Parra. In the Under 16, we find Theo Bareño-Lucas Bareño and Pola Carvajal-Sarah Lamim.\n\n\n\nIn the tournament in Egypt, boys and girls will play in the Under 12, Under 14, Under 16, and Under 18 categories. Among the youngest, the top pair is Hamza Elba-Malek Elkiek. In Under 14, it’s Fares Nassar-Zain Elbialy. In Under 16, look out for Aly Elnahas-Iker Zamora and Lily Wael-Malak Amer. In Under 18, the top pairs are Mohamed El-Hamamy-Wagdy and Rodayna Fathy-Nour Ramy.\n\n"
  },
  {
    "url": "https://www.padelfip.com/2025/08/island-padel-jersey-geens-olsson-and-touly-fassio-shine-in-great-britain/",
    "headline": "Island Padel Jersey, Geens-Olsson and Touly-Fassio shine in Great Britain",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/NEWS-WINNER-BRONZE-ISLAND-PADEL-JERSEY-1024x576.jpg"
      ]
    },
    "published_at": "August 12, 2025",
    "content": "Clement Geens and Albin Olsson for the men, Carla Touly and Camila Fassio for the women: they are the winners of the FIP Bronze in Jersey Island, a new event of the CUPRA FIP Tour, which returned to Great Britain after the FIP Silver in Bristol last April and the FIP Bronze in London in May.\n\n\n\nIn the men’s draw, the victory went to the team formed by Belgium’s number one, Clement Geens – who won the national championship a month ago – and the Swedish player Albin Olsson. They won in the final after coming back against the Italians Cremona-Graziotti, with the score 4-6, 6-2, 7-6.\n\n\n\n“Winning this beautiful tournament is very exciting. Thank you all for the great welcome, it was a pleasure to play here for the first time, I’m sure I’ll come back in the future,” said Clement Geens after the award ceremony.\n\n\n\nIn the women’s tournament, Carla Touly and Camila Fassio played very well. Fassio had also won the FIP Silver Trecar Cup in Sandigliano (Italy) three weeks ago. The French and Spanish players beat Carolina Navarro and Bruna Albuquerque in the final, 6-2, 6-1."
  },
  {
    "url": "https://www.padelfip.com/2025/08/portimao-laura-lujan-wins-her-tenth-title-in-the-cupra-fip-tour-equals-nati-lopez-diazs-record/",
    "headline": "Portimao, Laura Lujan wins her tenth title in the CUPRA FIP Tour: equals Nati Lopez Diaz’s record",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/News-Portimao-2-1024x576.jpg"
      ]
    },
    "published_at": "August 11, 2025",
    "content": "Laura Lujan made history again. With her win last weekend at the FIP Bronze Portimao, the player born in 2005 won her tenth title in the international tour (her first was the FIP Promises Marbella in 2023. In 2025, she already has three titles, after winning the FIP Bronze Qatar and the FIP Silver Port de Bandol). With this result, she has now reached the record held by Nati Lopez Diaz.\n\n\n\nIt was an important win for the Spanish player, who teamed up with Leti Manquillo (now with nine titles in this special ranking). They won the final 6-1 6-2 against their Spanish countrywomen Maria Portillo and Claudia Escacena.\n\n"
  },
  {
    "url": "https://www.padelfip.com/2025/08/portimao-another-win-for-dominguez-and-javi-ruiz/",
    "headline": "Portimao, another win for Dominguez and Javi Ruiz",
    "category": "padel",
    "visuals": {
      "images": [
        "https://www.padelfip.com/wp-content/uploads/2025/08/News-silver-portimao-1024x576.jpg"
      ]
    },
    "published_at": "August 11, 2025",
    "content": "Facundo Dominguez and Javi Ruiz are the winners of the FIP Silver Portimao. In this new event of the CUPRA FIP Tour in Portugal, the number 69 and number 49 in the ranking won 6-4 6-0 in the final against Jose Diestro, who had just won the FIP Silver Cote Du Midi and the FIP Silver Mimosa Open in Porto, and Teo Zapata.\n\n\n\n“We are happy to have won this beautiful tournament, we played at a very high level”, said Javi Ruiz, who now has three wins in 2025 after victories in Italy in June (FIP Silver Mediolanum Padel Cup in Palermo) and in Greece in July (FIP Silver Lyttos Crete I). For Facundo Dominguez, this is his second title of the year, after winning the FIP Silver Curitiba in March.\n\n"
  }
]